Revit 2027 API
LinkVisibility Enumeration
 Link visibility types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LinkVisibility
Public Enumeration LinkVisibility
public enum class LinkVisibility
type LinkVisibility
Members
Member name | Value | Description
ByHostView | 0
ByLinkView | 1
Custom | 2
See Also
Reference
Autodesk.Revit.DB Namespace